In [1]:
## Using Pandas

import pandas as pd

In [36]:
#scraped CCRB data off their website and made a 2 page excel file
df30 = pd.read_excel("CCRB_COMPLAINT_DATA.xlsx", sheet_name = "30th_PCT")
df26 = pd.read_excel("CCRB_COMPLAINT_DATA.xlsx", sheet_name = "26th_PCT")

In [37]:
## previewing respective sheet pages - 30th pct
df30.head()

                    Officer  Allegations  Substantiated  Most Recent   □
0      Guzman, Yoel  #23183            1              0        2,024 NaN
1    Barreto, Hector  #2659            4              0        2,024 NaN
2            Taveras, Robin           19              1        2,023 NaN
3  Lall, Anthony S.  #30452            7              0        2,023 NaN
4   Gonzalez, Sofia  #17700            1              0        2,023 NaN

In [38]:
## preview page 2 - 26 pct
df26.head()

                      Officer  Allegations  Substantiated  Most Recent
0     Polanco, Daniel  #23872            1              0        2,023
1           Raphique, Awaz I.            2              0        2,023
2   Delinois, Billendy  #2694           11              0        2,023
3  Salomone, Anthony J.  #591            3              0        2,023
4      Linares, Lucia  #29378            2              0        2,023

In [41]:
df30

,Officer,Allegations,Substantiated,Most Recent,□
0,"Guzman, Yoel #23183",1,0,"2,024",NaN
1,"Barreto, Hector #2659",4,0,"2,024",NaN
2,"Taveras, Robin",19,1,"2,023",NaN
3,"Lall, Anthony S. #30452",7,0,"2,023",NaN
4,"Gonzalez, Sofia #17700",1,0,"2,023",NaN
...,...,...,...,...,...
121,"Torresperez, Mabel #13462",0,0,NaN,NaN
122,"Torsiello, Juliana N. #29769",0,0,NaN,NaN
123,"Vella, Justin #10719",0,0,NaN,NaN
124,"Wha, Minho #13904",0,0,NaN,NaN
125,"Williams, Casey S. #26535",0,0,NaN,NaN

In [54]:
## find total allegations to zoom in on the data
total_allegations = df30.groupby("Allegations")
df30.groupby("Most Recent")["Allegations"].sum().to_frame("Thirty_PCT")

             Thirty_PCT
Most Recent
1,993                12
2,008                 1
2,009                 4
2,011                 3
2,012                 2
2,013                 1
2,015                 2
2,016                15
2,017                16
2,018                22
2,019                19
2,020                39
2,021                30
2,022                54
2,023               109
2,024                 5

In [65]:
## math to check the data
df30["Substantiated"].sum()

51

In [67]:
## math to check the data
df30["Allegations"].sum()

334

In [66]:
## math to check the data
df26["Allegations"].sum()

217

In [68]:
## math to check the data
df26["Substantiated"].sum()

19

In [97]:
## make DF for first sheet
df1 = df30[["Allegations","Substantiated"]].sum().to_frame("30_Pct")

In [98]:
## make DF for second sheet
df2 = df26[["Allegations","Substantiated"]].sum().to_frame("26_Pct")

In [99]:
## Create a new df to concat
dfs = [df1, df2]

In [104]:
## concat both pages and focused DF numbers
df = pd.concat(dfs, axis=1)

In [105]:
## creating my DF to export to csv to upload to datawrapper
df

               30_Pct  26_Pct
Allegations       334     217
Substantiated      51      19

In [107]:
## create CSV to use for visualization 
df.to_csv("ccrb_data.csv")